package lab7

/*1. Математичний вираз, що обчислюється, розташуйте всередині функції.
При цьому «у» – значенням функції,що повертається, «х поточне» і випадковий коефіцієнт «а» – параметрами.
2. Збережіть результати обчислень (х і у) у двовимірний масив, виведіть його на екран,
використовуючи форматований висновок.*/

import kotlin.math.*

fun main() {
    val a = (0..100).random().toDouble() // генерація випадкового коефіцієнта a в діапазоні від 0 до 100
    val x = 1.5 // поточне значення x

    val y = calculateExpression(a, x) // обчислення значення функції для вхідних параметрів

    val resultArray = arrayOf(arrayOf(x, y)) // створення двовимірного масиву із значеннями x та y
    println("Результати обчислень:")
    println("|   x   |   y    |")
    for (row in resultArray) {
        println("| ${"%.3f".format(row[0])} | ${"%.3f".format(row[1])} |") // форматований вивід на екран
    }
}

fun calculateExpression(a: Double, x: Double): Double {
    return 1.4e-4 * (2 * a).pow(3) + sqrt(sin(x)) / 2 + sqrt(cos(x)) / 2 / x
}